eisup_2019_docmng_integration/src/Documents/абс_РаспределениеРесурсовНаПроект/абс_РаспределениеРесурсовНаПроект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_РаспределениеРесурсовНаПроект</name>
  <registerRecords>AccumulationRegister.ОборотыБюджетов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодРаспределения</name>
    <type>
      <types>EnumRef.абс_МетодыРаспределенияРесурсовПоПроектам</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РаспределениеПоПроектам</name>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяОборотов</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>КВ</name>
      <type>
        <types>CatalogRef.абс_КапитальныеВложения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТЭО</name>
      <type>
        <types>CatalogRef.абс_ТЭО</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФУ</name>
      <type>
        <types>CatalogRef.абс_ЦФУ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодРаспределения</name>
      <type>
        <types>EnumRef.абс_МетодыРаспределенияРесурсовПоПроектам</types>
      </type>
    </attributes>
    <attributes>
      <name>РесурсПроекта</name>
      <type>
        <types>CatalogRef.абс_РесурсыПроектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регистратор</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРаспределения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОшибкиРаспредления</name>
    <attributes>
      <name>ОписаниеОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_РесурсыПоПроектамБаза/абс_РесурсыПоПроектамБаза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_РесурсыПоПроектамБаза</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.абс_РесурсыПроектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/абс_ЗатратыПоПроектам/абс_ЗатратыПоПроектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_ЗатратыПоПроектам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МетодРаспределения</name>
    <type>
      <types>EnumRef.абс_МетодыРаспределенияРесурсовПоПроектам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РесурсПроекта</name>
    <type>
      <types>CatalogRef.абс_РесурсыПроектов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/ОборотыБюджетов/ОборотыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборотыБюджетов</name>
  <comment>(Упр)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСценария</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_КВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипРасхода</name>
    <type>
      <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_СчетБУ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ttk_ОбъектБюджетирования</name>
    <type>
      <types>CatalogRef.ttk_ОбъектыБюджетирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ttk_Город</name>
    <type>
      <types>CatalogRef.ttk_Города</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Enums/абс_МетодыРаспределенияРесурсовПоПроектам/абс_МетодыРаспределенияРесурсовПоПроектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_МетодыРаспределенияРесурсовПоПроектам</name>
  <enumValues>
    <name>ПоНатуральнымПоказателям</name>
  </enumValues>
  <enumValues>
    <name>ПоПрямымЗатратам</name>
  </enumValues>
  <enumValues>
    <name>ПоОбъемуВыручки</name>
  </enumValues>
  <enumValues>
    <name>НаПроект</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <comment>(Упр)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Распределять</name>
      <description>Распределять</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала проекта</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>Дата окончания проекта</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПроектаКомпании</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Case</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Доходный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОснованиеПроекта</name>
    <type>
      <types>CatalogRef.абс_ОснованияПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПрефиксКодовПроектов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_РуководительПроекта</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТекущийЭтап</name>
    <type>
      <types>CatalogRef.абс_ЭтапыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВидПроекта</name>
    <type>
      <types>CatalogRef.абс_ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СуммаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДоходныйПроект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПлановаяДатаНачалаЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Портфель</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Комиссия</name>
    <type>
      <types>CatalogRef.КомиссияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НеТребуетсяСогласованиеРПвЗЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>абс_Заказы</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>абс_ВнутренниеЛимиты</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КВиТЗ</name>
      <type>
        <types>CatalogRef.абс_КапитальныеВложения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>абс_ЭтапыПроектов</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.абс_ЭтапыПроектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Documents/абс_РаспределениеРесурсовНаПроект/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция РаспределитьПоНатуральнымПоказателям(Организация, Период, МассивОшибок = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	абс_РесурсыПоПроектамБазаСрезПоследних.Проект,
	                      |	абс_РесурсыПоПроектамБазаСрезПоследних.Ресурс,
	                      |	абс_РесурсыПоПроектамБазаСрезПоследних.Значение КАК Коэффициент
	                      |ПОМЕСТИТЬ РесурсыПоПроектамДетально
	                      |ИЗ
	                      |	РегистрСведений.абс_РесурсыПоПроектамБаза.СрезПоследних(&Период, Проект.абс_Организация = &Организация) КАК абс_РесурсыПоПроектамБазаСрезПоследних
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СУММА(ВТ_РесурсыПоПроектам.Коэффициент) КАК Коэффициент,
	                      |	ВТ_РесурсыПоПроектам.Ресурс
	                      |ПОМЕСТИТЬ СуммаКэфициентовПоРесурсу
	                      |ИЗ
	                      |	РесурсыПоПроектамДетально КАК ВТ_РесурсыПоПроектам
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_РесурсыПоПроектам.Ресурс
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	РесурсыПоПроектамДетально.Проект,
	                      |	РесурсыПоПроектамДетально.Ресурс,
	                      |	РесурсыПоПроектамДетально.Коэффициент КАК КоэффициентЗначение,
	                      |	СуммаКэфициентовПоРесурсу.Коэффициент КАК СуммаКоэффициентов,
	                      |	ВЫБОР
	                      |		КОГДА РесурсыПоПроектамДетально.Коэффициент = 0
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВЫРАЗИТЬ(РесурсыПоПроектамДетально.Коэффициент / СуммаКэфициентовПоРесурсу.Коэффициент КАК ЧИСЛО(15, 6))
	                      |	КОНЕЦ КАК Коэффициент
	                      |ПОМЕСТИТЬ КоэффициентаПоРесурсам
	                      |ИЗ
	                      |	РесурсыПоПроектамДетально КАК РесурсыПоПроектамДетально
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммаКэфициентовПоРесурсу КАК СуммаКэфициентовПоРесурсу
	                      |		ПО РесурсыПоПроектамДетально.Ресурс = СуммаКэфициентовПоРесурсу.Ресурс
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	абс_ЗатратыПоПроектамОбороты.ЦФО,
	                      |	абс_ЗатратыПоПроектамОбороты.СтатьяОборотов,
	                      |	абс_ЗатратыПоПроектамОбороты.КВ,
	                      |	абс_ЗатратыПоПроектамОбороты.ТЭО,
	                      |	абс_ЗатратыПоПроектамОбороты.ЦФУ,
	                      |	абс_ЗатратыПоПроектамОбороты.ДоговорКонтрагента,
	                      |	абс_ЗатратыПоПроектамОбороты.РесурсПроекта,
	                      |	абс_ЗатратыПоПроектамОбороты.СуммаОборот КАК Сумма,
	                      |	абс_ЗатратыПоПроектамОбороты.МетодРаспределения,
	                      |	абс_ЗатратыПоПроектамОбороты.Регистратор
	                      |ПОМЕСТИТЬ ЗатратыПоПроектамДетально
	                      |ИЗ
	                      |	РегистрНакопления.абс_ЗатратыПоПроектам.Обороты(
	                      |			&НачалоПериода,
	                      |			&КонецПериода,
	                      |			Регистратор,
	                      |			Организация = &Организация
	                      |				И МетодРаспределения = &Метод) КАК абс_ЗатратыПоПроектамОбороты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ЗатратыПоПроектам.РесурсПроекта,
	                      |	СУММА(ВТ_ЗатратыПоПроектам.Сумма) КАК Сумма
	                      |ПОМЕСТИТЬ СуммаЗатратыПоРесурсам
	                      |ИЗ
	                      |	ЗатратыПоПроектамДетально КАК ВТ_ЗатратыПоПроектам
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_ЗатратыПоПроектам.РесурсПроекта
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЗатратыПоПроектамДетально.ЦФО,
	                      |	ЗатратыПоПроектамДетально.СтатьяОборотов,
	                      |	ЗатратыПоПроектамДетально.КВ,
	                      |	ЗатратыПоПроектамДетально.ЦФУ,
	                      |	ЗатратыПоПроектамДетально.ДоговорКонтрагента,
	                      |	ЗатратыПоПроектамДетально.РесурсПроекта КАК РесурсПроекта,
	                      |	КоэффициентаПоРесурсам.Проект КАК Проект,
	                      |	СуммаЗатратыПоРесурсам.Сумма КАК СуммаПоРесурсам,
	                      |	КоэффициентаПоРесурсам.Коэффициент КАК Коэффициент,
	                      |	ЗатратыПоПроектамДетально.Сумма КАК Сумма,
	                      |	ЗатратыПоПроектамДетально.МетодРаспределения,
	                      |	ЗатратыПоПроектамДетально.Регистратор,
	                      |	КоэффициентаПоРесурсам.Проект.абс_ТЭО КАК ТЭО
	                      |ИЗ
	                      |	ЗатратыПоПроектамДетально КАК ЗатратыПоПроектамДетально
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентаПоРесурсам КАК КоэффициентаПоРесурсам
	                      |		ПО (КоэффициентаПоРесурсам.Ресурс = ЗатратыПоПроектамДетально.РесурсПроекта)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ СуммаЗатратыПоРесурсам КАК СуммаЗатратыПоРесурсам
	                      |		ПО (СуммаЗатратыПоРесурсам.РесурсПроекта = ЗатратыПоПроектамДетально.РесурсПроекта)
	                      |ИТОГИ
	                      |	МАКСИМУМ(СуммаПоРесурсам),
	                      |	МАКСИМУМ(Коэффициент)
	                      |ПО
	                      |	РесурсПроекта,
	                      |	Проект");
						  
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецМесяца(Период)));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Организация", Организация);						  
	Запрос.УстановитьПараметр("Период", Новый Граница(КонецМесяца(Период)));
	Запрос.УстановитьПараметр("Метод", Перечисления.абс_МетодыРаспределенияРесурсовПоПроектам.ПоНатуральнымПоказателям);
	
	Результат = Запрос.Выполнить();
	ТЗ = ПолучитьТЗПоРезультатуЗапроса(Результат);
	ВыборкаПоРесурсам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоРесурсам.Следующий() Цикл 
		
		ВыборкаПоПроектам = ВыборкаПоРесурсам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоПроектам.Следующий() Цикл 
			
			Если ЗначениеЗаполнено(ВыборкаПоПроектам.Проект) Тогда 
				СуммаПоПроекту = ВыборкаПоПроектам.СуммаПоРесурсам * ВыборкаПоПроектам.Коэффициент;
			Иначе
				ЗаписатьОшибку(МассивОшибок, "Отсутствуют коэффициенты для распределения затрат по ресурсу: " + Строка(ВыборкаПоПроектам.РесурсПроекта));
				Продолжить;
			КонецЕсли;
			
			й = 1;
			ОсталосьРаспределить = СуммаПоПроекту;
			Выборка = ВыборкаПоПроектам.Выбрать();
			
			Пока Выборка.Следующий() Цикл 
				
				НоваяСтрока = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
				Если й <> Выборка.Количество() Тогда 
					НоваяСтрока.Сумма = ?(ЗначениеЗаполнено(ВыборкаПоПроектам.СуммаПоРесурсам), 
											(Выборка.Сумма / ВыборкаПоПроектам.СуммаПоРесурсам) * СуммаПоПроекту, 0);
				Иначе
					НоваяСтрока.Сумма = ОсталосьРаспределить;	
				КонецЕсли;
				
				й = й + 1;
				ОсталосьРаспределить = ОсталосьРаспределить - НоваяСтрока.Сумма;
				
			КонецЦикла;	
		КонецЦикла;
	КонецЦикла;	
	
	Возврат ТЗ;
	
КонецФункции

Функция РаспределитьПоОборотамБюджета(Организация, Период, ПоВыручке = Истина, МассивОшибок = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	абс_ЗатратыПоПроектамОбороты.ЦФО,
	                      |	абс_ЗатратыПоПроектамОбороты.СтатьяОборотов,
	                      |	абс_ЗатратыПоПроектамОбороты.КВ,
	                      |	абс_ЗатратыПоПроектамОбороты.ТЭО,
	                      |	абс_ЗатратыПоПроектамОбороты.ЦФУ,
	                      |	абс_ЗатратыПоПроектамОбороты.ДоговорКонтрагента,
	                      |	абс_ЗатратыПоПроектамОбороты.СуммаОборот КАК Сумма,
	                      |	абс_ЗатратыПоПроектамОбороты.МетодРаспределения,
	                      |	абс_ЗатратыПоПроектамОбороты.Регистратор
	                      |ПОМЕСТИТЬ ЗатратыПоПроектамДетально
	                      |ИЗ
	                      |	РегистрНакопления.абс_ЗатратыПоПроектам.Обороты(
	                      |			&НачалоПериода,
	                      |			&КонецПериода,
	                      |			Регистратор,
	                      |			МетодРаспределения = &Метод
	                      |				И Организация = &Организация) КАК абс_ЗатратыПоПроектамОбороты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЗатратыПоПроектамДетально.ДоговорКонтрагента,
	                      |	СУММА(ЗатратыПоПроектамДетально.Сумма) КАК Сумма
	                      |ПОМЕСТИТЬ ЗатратыПоДоговору
	                      |ИЗ
	                      |	ЗатратыПоПроектамДетально КАК ЗатратыПоПроектамДетально
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗатратыПоПроектамДетально.ДоговорКонтрагента
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЗатратыПоПроектамДетально.ДоговорКонтрагента,
	                      |	ДоговорыКонтрагентовабс_Проекты.Проект
	                      |ПОМЕСТИТЬ ДоговораПоПроектам
	                      |ИЗ
	                      |	ЗатратыПоПроектамДетально КАК ЗатратыПоПроектамДетально
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.абс_Проекты КАК ДоговорыКонтрагентовабс_Проекты
	                      |		ПО ЗатратыПоПроектамДетально.ДоговорКонтрагента = ДоговорыКонтрагентовабс_Проекты.Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗатратыПоПроектамДетально.ДоговорКонтрагента,
	                      |	ДоговорыКонтрагентовабс_Проекты.Проект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДоговораПоПроектам.ДоговорКонтрагента
	                      |ПОМЕСТИТЬ ДоговораПоПроектамБезПроектов
	                      |ИЗ
	                      |	ДоговораПоПроектам КАК ДоговораПоПроектам
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ДоговораПоПроектам.ДоговорКонтрагента
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ОборотыБюджетовОбороты.Проект,
	                      |	СУММА(ОборотыБюджетовОбороты.СуммаСценарияОборот) КАК Выручка,
	                      |	ОборотыБюджетовОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента
	                      |ПОМЕСТИТЬ ОборотыБюджета
	                      |ИЗ
	                      |	РегистрНакопления.ОборотыБюджетов.Обороты(
	                      |			&НачалоПериода,
	                      |			&КонецПериода,
	                      |			Регистратор,
	                      |			Организация = &Организация
	                      |				И СтатьяОборотов.абс_ДоходнаяСтатья = &Доходная
	                      |				И Проект <> ЗНАЧЕНИЕ(Справочник.Проекты.Распределять)
	                      |				И Проект <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	                      |				И Сценарий В (&МассивСценариев)) КАК ОборотыБюджетовОбороты
	                      |ГДЕ
	                      |	НЕ ОборотыБюджетовОбороты.Регистратор ССЫЛКА Документ.абс_РаспределениеРесурсовНаПроект
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ОборотыБюджетовОбороты.Проект,
	                      |	ОборотыБюджетовОбороты.ДоговорКонтрагента
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	СУММА(ВыручкаПоДоговорам.Выручка) КАК Выручка
	                      |ПОМЕСТИТЬ ВыручкаИтого
	                      |ИЗ
	                      |	ОборотыБюджета КАК ВыручкаПоДоговорам
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	СУММА(ОборотыБюджета.Выручка) КАК Выручка
	                      |ПОМЕСТИТЬ ВыручкаПоДоговорамИтого
	                      |ИЗ
	                      |	ОборотыБюджета КАК ОборотыБюджета
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДоговораПоПроектам КАК ДоговораПоПроектам
	                      |		ПО ОборотыБюджета.Проект = ДоговораПоПроектам.Проект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	СУММА(ВыручкаПоДоговорам.Выручка) КАК Выручка,
	                      |	ВыручкаПоДоговорам.Проект КАК Проект
	                      |ПОМЕСТИТЬ ВыручкаПоПроектам
	                      |ИЗ
	                      |	ОборотыБюджета КАК ВыручкаПоДоговорам
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВыручкаПоДоговорам.Проект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ОборотыБюджета.Проект,
	                      |	СУММА(ОборотыБюджета.Выручка) КАК Выручка
	                      |ПОМЕСТИТЬ ОборотыБюджетаПоДоговорамПоПроектам
	                      |ИЗ
	                      |	ОборотыБюджета КАК ОборотыБюджета
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДоговораПоПроектам КАК ДоговораПоПроектам
	                      |		ПО ОборотыБюджета.Проект = ДоговораПоПроектам.Проект
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ОборотыБюджета.Проект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВЫБОР
	                      |		КОГДА ВыручкаИтого.Выручка = 0
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВЫРАЗИТЬ(ВыручкаПоПроектам.Выручка / ВыручкаИтого.Выручка КАК ЧИСЛО(15, 6))
	                      |	КОНЕЦ КАК Коэффициент,
	                      |	ВыручкаПоПроектам.Проект
	                      |ПОМЕСТИТЬ Коэффициенты
	                      |ИЗ
	                      |	ВыручкаПоПроектам КАК ВыручкаПоПроектам,
	                      |	ВыручкаИтого КАК ВыручкаИтого
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВЫБОР
	                      |		КОГДА ВыручкаПоДоговорамИтого.Выручка = 0
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВЫРАЗИТЬ(ОборотыБюджетаПоДоговорамПоПроектам.Выручка / ВыручкаПоДоговорамИтого.Выручка КАК ЧИСЛО(15, 2))
	                      |	КОНЕЦ КАК Коэффициент,
	                      |	ОборотыБюджетаПоДоговорамПоПроектам.Проект
	                      |ПОМЕСТИТЬ Коэффициенты2
	                      |ИЗ
	                      |	ОборотыБюджетаПоДоговорамПоПроектам КАК ОборотыБюджетаПоДоговорамПоПроектам,
	                      |	ВыручкаПоДоговорамИтого КАК ВыручкаПоДоговорамИтого
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ЗатратыПоПроектамДетально.ДоговорКонтрагента КАК ДоговорКонтрагента,
	                      |	Коэффициенты.Проект КАК Проект,
	                      |	ЗатратыПоПроектамДетально.Сумма КАК Сумма,
	                      |	Коэффициенты.Коэффициент КАК Коэффициент,
	                      |	ЗатратыПоПроектамДетально.ЦФО,
	                      |	ЗатратыПоПроектамДетально.СтатьяОборотов,
	                      |	ЗатратыПоПроектамДетально.КВ,
	                      |	ЗатратыПоПроектамДетально.ЦФУ,
	                      |	ЗатратыПоПроектамДетально.МетодРаспределения,
	                      |	ЗатратыПоПроектамДетально.Регистратор,
	                      |	Коэффициенты.Проект.абс_ТЭО КАК ТЭО,
	                      |	ЗатратыПоДоговору.Сумма КАК ЗатратыПоДоговору
	                      |ПОМЕСТИТЬ ВТ_Распределение
	                      |ИЗ
	                      |	ЗатратыПоПроектамДетально КАК ЗатратыПоПроектамДетально
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ДоговораПоПроектам КАК ДоговораПоПроектам
	                      |		ПО ЗатратыПоПроектамДетально.ДоговорКонтрагента = ДоговораПоПроектам.ДоговорКонтрагента
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗатратыПоДоговору КАК ЗатратыПоДоговору
	                      |		ПО ЗатратыПоПроектамДетально.ДоговорКонтрагента = ЗатратыПоДоговору.ДоговорКонтрагента,
	                      |	Коэффициенты КАК Коэффициенты
	                      |ГДЕ
	                      |	ДоговораПоПроектам.ДоговорКонтрагента ЕСТЬ NULL 
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЗатратыПоПроектамДетально.ЦФО,
	                      |	ЗатратыПоПроектамДетально.СтатьяОборотов,
	                      |	ЗатратыПоПроектамДетально.КВ,
	                      |	ЗатратыПоПроектамДетально.ТЭО,
	                      |	ЗатратыПоПроектамДетально.ЦФУ,
	                      |	ЗатратыПоПроектамДетально.ДоговорКонтрагента,
	                      |	ЗатратыПоПроектамДетально.Сумма,
	                      |	ЗатратыПоПроектамДетально.МетодРаспределения,
	                      |	ЗатратыПоПроектамДетально.Регистратор,
	                      |	Коэффициенты2.Коэффициент,
	                      |	Коэффициенты2.Проект,
	                      |	ЗатратыПоДоговору.Сумма КАК ЗатратыПоДоговору
	                      |ПОМЕСТИТЬ ВТ_Распределение2
	                      |ИЗ
	                      |	ЗатратыПоПроектамДетально КАК ЗатратыПоПроектамДетально
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗатратыПоДоговору КАК ЗатратыПоДоговору
	                      |		ПО ЗатратыПоПроектамДетально.ДоговорКонтрагента = ЗатратыПоДоговору.ДоговорКонтрагента,
	                      |	Коэффициенты2 КАК Коэффициенты2
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Распределение.ДоговорКонтрагента КАК ДоговорКонтрагента,
	                      |	ВТ_Распределение.Проект КАК Проект,
	                      |	ВТ_Распределение.Сумма КАК Сумма,
	                      |	ВТ_Распределение.Коэффициент КАК Коэффициент,
	                      |	ВТ_Распределение.ЦФО,
	                      |	ВТ_Распределение.СтатьяОборотов,
	                      |	ВТ_Распределение.КВ,
	                      |	ВТ_Распределение.ЦФУ,
	                      |	ВТ_Распределение.МетодРаспределения,
	                      |	ВТ_Распределение.Регистратор,
	                      |	ВТ_Распределение.ТЭО,
	                      |	1 КАК ВидРаспределения,
	                      |	ВТ_Распределение.ЗатратыПоДоговору КАК ЗатратыПоДоговору
	                      |ИЗ
	                      |	ВТ_Распределение КАК ВТ_Распределение
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЕСТЬNULL(ВТ_Распределение2.ДоговорКонтрагента, ДоговораПоПроектамБезПроектов.ДоговорКонтрагента),
	                      |	ВТ_Распределение2.Проект,
	                      |	ВТ_Распределение2.Сумма,
	                      |	ВТ_Распределение2.Коэффициент,
	                      |	ВТ_Распределение2.ЦФО,
	                      |	ВТ_Распределение2.СтатьяОборотов,
	                      |	ВТ_Распределение2.КВ,
	                      |	ВТ_Распределение2.ЦФУ,
	                      |	ВТ_Распределение2.МетодРаспределения,
	                      |	ВТ_Распределение2.Регистратор,
	                      |	ВТ_Распределение2.ТЭО,
	                      |	2,
	                      |	ВТ_Распределение2.ЗатратыПоДоговору
	                      |ИЗ
	                      |	ДоговораПоПроектамБезПроектов КАК ДоговораПоПроектамБезПроектов
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Распределение2 КАК ВТ_Распределение2
	                      |		ПО ДоговораПоПроектамБезПроектов.ДоговорКонтрагента = ВТ_Распределение2.ДоговорКонтрагента
	                      |ИТОГИ
	                      |	МАКСИМУМ(Сумма),
	                      |	МАКСИМУМ(Коэффициент),
	                      |	МАКСИМУМ(ЗатратыПоДоговору)
	                      |ПО
	                      |	ВидРаспределения,
	                      |	ДоговорКонтрагента");
						  
	Запрос.УстановитьПараметр("КонецПериода", 	Новый Граница(КонецМесяца(Период)));
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Организация", 	Организация);						  
	Запрос.УстановитьПараметр("Период", 		Новый Граница(КонецМесяца(Период)));
	Запрос.УстановитьПараметр("МассивСценариев",ПолучитьМассивСценариевФакт());
	Запрос.УстановитьПараметр("Доходная", 		ПоВыручке);
	
	Если ПоВыручке Тогда 
		Запрос.УстановитьПараметр("Метод", Перечисления.абс_МетодыРаспределенияРесурсовПоПроектам.ПоОбъемуВыручки);	
	Иначе
		Запрос.УстановитьПараметр("Метод", Перечисления.абс_МетодыРаспределенияРесурсовПоПроектам.ПоПрямымЗатратам);
	КонецЕсли;

	
	Результат = Запрос.Выполнить();
	ТЗ = ПолучитьТЗПоРезультатуЗапроса(Результат);	
	ВыборкаПоРесурсам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоРесурсам.Следующий() Цикл 
		
		ВыборкаПоПроектам = ВыборкаПоРесурсам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоПроектам.Следующий() Цикл 
			
			Если НЕ ЗначениеЗаполнено(ВыборкаПоПроектам.Коэффициент) Тогда 
				Если ПоВыручке Тогда 
					ЗаписатьОшибку(МассивОшибок, "Отсутствует выручка для распределения затрат по договору " + Строка(ВыборкаПоПроектам.ДоговорКонтрагента));
					
				Иначе
					ЗаписатьОшибку(МассивОшибок, "Отсутствуют прямые затраты по проекту для распределения затрат по договору " + Строка(ВыборкаПоПроектам.ДоговорКонтрагента));
				КонецЕсли;
				Продолжить;
			КонецЕсли;
			
			й = 1;
			ОсталосьРаспределить = ВыборкаПоПроектам.ЗатратыПоДоговору;
			Выборка = ВыборкаПоПроектам.Выбрать();
			Пока Выборка.Следующий() Цикл 
				
				НоваяСтрока = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
				
				Если й <> Выборка.Количество() Тогда 
					НоваяСтрока.Сумма = НоваяСтрока.Сумма * НоваяСтрока.Коэффициент;;
				Иначе
					НоваяСтрока.Сумма = ОсталосьРаспределить;	
				КонецЕсли;
				
				й = й + 1;
				ОсталосьРаспределить = ОсталосьРаспределить - НоваяСтрока.Сумма;
			КонецЦикла;	
		КонецЦикла;
	КонецЦикла;	
	
	Возврат ТЗ;
	
КонецФункции

Функция ПолучитьДанныеДляПроведенияОборотыБюджетов(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.ЦФО,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.СтатьяОборотов,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.КВ КАК КВ,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.ТЭО КАК ТЭО,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.ЦФУ КАК ЦФУ,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.ДоговорКонтрагента,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.Проект,
	                      |	СУММА(абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.Сумма) КАК Сумма,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.Ссылка КАК Ссылка,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.Регистратор КАК ДокументРегистратор
	                      |ПОМЕСТИТЬ ВТ_ТаблицаРаспределения
	                      |ИЗ
	                      |	Документ.абс_РаспределениеРесурсовНаПроект.РаспределениеПоПроектам КАК абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам
	                      |ГДЕ
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.ЦФО,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.ТЭО,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.ЦФУ,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.СтатьяОборотов,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.КВ,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.ДоговорКонтрагента,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.Проект,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.Ссылка,
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.Регистратор
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.Регистратор КАК ДокументРегистратор
	                      |ПОМЕСТИТЬ РегистраторыДляСторно
	                      |ИЗ
	                      |	Документ.абс_РаспределениеРесурсовНаПроект.РаспределениеПоПроектам КАК абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам
	                      |ГДЕ
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	абс_РаспределениеРесурсовНаПроектРаспределениеПоПроектам.Регистратор
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	РегистраторыДляСторно.ДокументРегистратор,
	                      |	МАКСИМУМ(ОборотыБюджетовОбороты.Сценарий) КАК Сценарий
	                      |ПОМЕСТИТЬ СценарииПоРегистратору
	                      |ИЗ
	                      |	РегистраторыДляСторно КАК РегистраторыДляСторно
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыБюджетов.Обороты(, , Регистратор, ) КАК ОборотыБюджетовОбороты
	                      |		ПО РегистраторыДляСторно.ДокументРегистратор = ОборотыБюджетовОбороты.Регистратор
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РегистраторыДляСторно.ДокументРегистратор
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ТаблицаРаспределения.ЦФО,
	                      |	ВТ_ТаблицаРаспределения.СтатьяОборотов,
	                      |	ВТ_ТаблицаРаспределения.КВ КАК абс_КВ,
	                      |	ВТ_ТаблицаРаспределения.ТЭО КАК абс_ТЭО,
	                      |	ВТ_ТаблицаРаспределения.ЦФУ КАК абс_ЦФУ,
	                      |	ВТ_ТаблицаРаспределения.ДоговорКонтрагента,
	                      |	ВТ_ТаблицаРаспределения.Проект,
	                      |	СУММА(ВТ_ТаблицаРаспределения.Сумма) КАК СуммаСценария,
	                      |	ВТ_ТаблицаРаспределения.ДоговорКонтрагента.Владелец КАК Контрагент,
	                      |	ВЫБОР
	                      |		КОГДА СценарииПоРегистратору.Сценарий ЕСТЬ НЕ NULL 
	                      |			ТОГДА СценарииПоРегистратору.Сценарий
	                      |		ИНАЧЕ &Сценарий
	                      |	КОНЕЦ,
	                      |	ИСТИНА КАК Активность,
	                      |	ВТ_ТаблицаРаспределения.ДоговорКонтрагента.Владелец.абс_ТипыКонтрагентов КАК абс_ТипКонтрагента,
	                      |	СУММА(ВТ_ТаблицаРаспределения.Сумма) КАК ВалютнаяСумма,
	                      |	СУММА(ВТ_ТаблицаРаспределения.Сумма) КАК СуммаУпр,
	                      |	&Валюта,
	                      |	NULL КАК Номенклатура,
	                      |	NULL КАК абс_ТипСети,
	                      |	NULL КАК абс_ТипРасхода,
	                      |	ВТ_ТаблицаРаспределения.Ссылка.Организация КАК Организация,
	                      |	NULL КАК абс_СчетБУ,
	                      |	NULL КАК КоличествоОборот,
	                      |	&Период
	                      |ИЗ
	                      |	ВТ_ТаблицаРаспределения КАК ВТ_ТаблицаРаспределения
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ СценарииПоРегистратору КАК СценарииПоРегистратору
	                      |		ПО ВТ_ТаблицаРаспределения.ДокументРегистратор = СценарииПоРегистратору.ДокументРегистратор
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_ТаблицаРаспределения.ЦФО,
	                      |	ВТ_ТаблицаРаспределения.ТЭО,
	                      |	ВТ_ТаблицаРаспределения.ЦФУ,
	                      |	ВТ_ТаблицаРаспределения.СтатьяОборотов,
	                      |	ВТ_ТаблицаРаспределения.КВ,
	                      |	ВТ_ТаблицаРаспределения.ДоговорКонтрагента,
	                      |	ВТ_ТаблицаРаспределения.Проект,
	                      |	ВТ_ТаблицаРаспределения.ДоговорКонтрагента.Владелец,
	                      |	ВТ_ТаблицаРаспределения.ДоговорКонтрагента.Владелец.абс_ТипыКонтрагентов,
	                      |	ВТ_ТаблицаРаспределения.Ссылка.Организация,
	                      |	ВЫБОР
	                      |		КОГДА СценарииПоРегистратору.Сценарий ЕСТЬ НЕ NULL 
	                      |			ТОГДА СценарииПоРегистратору.Сценарий
	                      |		ИНАЧЕ &Сценарий
	                      |	КОНЕЦ
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОборотыБюджетовОбороты.ЦФО,
	                      |	ОборотыБюджетовОбороты.СтатьяОборотов,
	                      |	ОборотыБюджетовОбороты.абс_КВ,
	                      |	ОборотыБюджетовОбороты.абс_ТЭО,
	                      |	ОборотыБюджетовОбороты.абс_ЦФУ,
	                      |	ОборотыБюджетовОбороты.ДоговорКонтрагента,
	                      |	ОборотыБюджетовОбороты.Проект,
	                      |	-ОборотыБюджетовОбороты.СуммаСценарияОборот,
	                      |	ОборотыБюджетовОбороты.Контрагент,
	                      |	ОборотыБюджетовОбороты.Сценарий,
	                      |	ИСТИНА,
	                      |	ОборотыБюджетовОбороты.абс_ТипКонтрагента,
	                      |	-ОборотыБюджетовОбороты.ВалютнаяСуммаОборот,
	                      |	-ОборотыБюджетовОбороты.СуммаУпрОборот,
	                      |	ОборотыБюджетовОбороты.Валюта,
	                      |	ОборотыБюджетовОбороты.Номенклатура,
	                      |	ОборотыБюджетовОбороты.абс_ТипСети,
	                      |	ОборотыБюджетовОбороты.абс_ТипРасхода,
	                      |	ОборотыБюджетовОбороты.Организация,
	                      |	ОборотыБюджетовОбороты.абс_СчетБУ,
	                      |	-ОборотыБюджетовОбороты.КоличествоОборот,
	                      |	&Период
	                      |ИЗ
	                      |	РегистрНакопления.ОборотыБюджетов.Обороты(
	                      |			,
	                      |			,
	                      |			Регистратор,
	                      |			(Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	                      |				ИЛИ Проект = ЗНАЧЕНИЕ(Справочник.Проекты.Распределять))
	                      |				И Сценарий.абс_Факт) КАК ОборотыБюджетовОбороты
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистраторыДляСторно КАК РегистраторыДляСторно
	                      |		ПО ОборотыБюджетовОбороты.Регистратор = РегистраторыДляСторно.ДокументРегистратор");
						  
	Запрос.УстановитьПараметр("Ссылка", 	ДокументСсылка);
	Запрос.УстановитьПараметр("Период", 	КонецМесяца(ДокументСсылка.Дата));
	Запрос.УстановитьПараметр("Сценарий", 	глЗначениеПеременной("абс_СценарийДляФакта"));
	Запрос.УстановитьПараметр("Валюта", 	глЗначениеПеременной("ВалютаРегламентированногоУчета"));
	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьМассивСценариевФакт() Экспорт
	
	СписокСценариевФакт = Новый Массив;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СценарииПланирования.Ссылка
	                      |ИЗ
	                      |	Справочник.СценарииПланирования КАК СценарииПланирования
	                      |ГДЕ
	                      |	СценарииПланирования.абс_Факт");
						  
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 	
		СписокСценариевФакт.Добавить(Выборка.Ссылка);		
	КонецЦикла;
		
	Возврат СписокСценариевФакт;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ


Функция ПолучитьТЗПоРезультатуЗапроса(Результат)
	
	ТЗ = Новый ТаблицаЗначений;
	Для Каждого колонки из Результат.Колонки Цикл 
		ТЗ.Колонки.Добавить(колонки.Имя, колонки.ТипЗначения);
	КонецЦикла;
	
	Возврат ТЗ;
		
КонецФункции

Процедура ЗаписатьОшибку(МассивОшибок, ОписаниеОшибки)
	
	Если МассивОшибок = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(МассивОшибок) <> Тип("Массив") Тогда 
		Возврат;
	КонецЕсли;
	
	МассивОшибок.Добавить(ОписаниеОшибки);
	
КонецПроцедуры
